from string import Template

#### RAG PROMPT ####

#### SYSTEM ####

system_prompt = Template("\n".join([
    "أنت مساعد مهمتك توليد رد للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة باستعلام المستخدم.",
    "عليك توليد رد بناءً على المستندات المقدمة.",
    "تجاهل المستندات غير ذات الصلة باستعلام المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد رد.",
    "يجب عليك توليد الرد بنفس لغة استعلام المستخدم.",
    "كن مهذبًا ومحترمًا مع المستخدم.",
    "كن دقيقًا وموجزًا في ردك. تجنب المعلومات غير الضرورية.",
]))

#### Document ####
document_prompt = Template('\n'.join([
    "## رقم المستند: $doc_num",
    "### المحتوى: $chunk_text",
]))

#### Footer ####
footer_prompt = Template('\n'.join([
    "بناءً على المستندات أعلاه فقط، يرجى توليد إجابة للمستخدم.",
    "## الإجابة:",
]))